In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/test

In [2]:
%%sql
DROP TABLE IF EXISTS Orders;
DROP TABLE IF EXISTS Restaurants;

CREATE TABLE Restaurants (
    id INT  PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    location VARCHAR(100) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [3]:
%%sql
INSERT INTO Restaurants (id, name, location) VALUES
(1, 'ABC Bistro', 'New York'),
(2, 'The Foodie', 'Los Angeles'),
(3, 'Tasty Treat', 'Chicago');

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[]

In [4]:
%%sql
CREATE TABLE Orders (
    order_id INT PRIMARY KEY,
    restaurant_id INT NOT NULL,
    order_date DATE NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [5]:
%%sql
INSERT INTO Orders (order_id,restaurant_id, order_date) VALUES
(1, 1, '2023-01-01'),
(2, 1, '2023-01-02'),
(3, 2, '2023-01-05'),
(4, 4, '2023-01-07');

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[]

In [12]:
%%sql
select * from Restaurants

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[(1, 'ABC Bistro', 'New York'),
 (2, 'The Foodie', 'Los Angeles'),
 (3, 'Tasty Treat', 'Chicago')]

In [13]:
%%sql
select * from Orders

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[(1, 1, datetime.date(2023, 1, 1)),
 (2, 1, datetime.date(2023, 1, 2)),
 (3, 2, datetime.date(2023, 1, 5)),
 (4, 4, datetime.date(2023, 1, 7))]

In [22]:
#join &inner join
%%sql
select 
r.name as restaurant_name,
o.order_date
from Restaurants r
join Orders o on r.id = o.restaurant_id
join customers c on c.cust_id = o.customer_id #THIS FOR ANOTHER TABLE JOIN

 * mysql+mysqlconnector://root:***@localhost/test
3 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 5))]

In [23]:
#lEFT JOIN ACCEPT ALL LEFT TABLE DATA
%%sql
select 
r.name as restaurant_name,
o.order_date
from Restaurants r
left join Orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 2)),
 ('ABC Bistro', datetime.date(2023, 1, 1)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 ('Tasty Treat', None)]

In [24]:
#RIGHT JOIN ACCEPT ALL RIGHT TABLE DATA AND ITS RARE CASE WE USE RIGHT JOIN
%%sql
select 
r.name as restaurant_name,
o.order_date
from Restaurants r
right join Orders o on r.id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[('ABC Bistro', datetime.date(2023, 1, 1)),
 ('ABC Bistro', datetime.date(2023, 1, 2)),
 ('The Foodie', datetime.date(2023, 1, 5)),
 (None, datetime.date(2023, 1, 7))]

In [ ]:
#SELF JOIN

In [27]:
%%sql
select 
o.order_date,
d.order_date as rest
from Orders o
left join Orders d
on d.order_id = o.restaurant_id

 * mysql+mysqlconnector://root:***@localhost/test
4 rows affected.

[(datetime.date(2023, 1, 1), datetime.date(2023, 1, 1)),
 (datetime.date(2023, 1, 2), datetime.date(2023, 1, 1)),
 (datetime.date(2023, 1, 5), datetime.date(2023, 1, 2)),
 (datetime.date(2023, 1, 7), datetime.date(2023, 1, 7))]